llm/kimi_k27_code/b200/bench/bench_random_mid.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
[...]
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='moonshotai/Kimi-K2.7-Code', served_model_name=None, tokenizer=None, num_prompts=300, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/mnt/local_disk/bbuf/kda-pilot/llm/kimi_k27_code/b200/bench/random_mid.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=True, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=10, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir='/mnt/local_disk/bbuf/kda-pilot/llm/kimi_k27_code/b200/profile/random_mid', profile_prefix='random_mid', lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='moonshotai/Kimi-K2.7-Code', served_model_name=None, tokenizer=None, num_prompts=300, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/mnt/local_disk/bbuf/kda-pilot/llm/kimi_k27_code/b200/bench/random_mid.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=True, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=10, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir='/mnt/local_disk/bbuf/kda-pilot/llm/kimi_k27_code/b200/profile/random_mid', profile_prefix='random_mid', lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 148474
#Output tokens: 155289
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
Starting profiler...
async_request_profile api_url='http://127.0.0.1:30000/start_profile' body={'activities': ['CPU', 'GPU'], 'num_steps': None, 'profile_by_stage': False, 'profile_stages': None, 'output_dir': '/mnt/local_disk/bbuf/kda-pilot/llm/kimi_k27_code/b200/profile/random_mid/1781854148.986584', 'profile_prefix': 'random_mid'}
Profiler started

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     300       
Benchmark duration (s):                  107.55    
Total input tokens:                      148474    
Total input text tokens:                 148474    
Total generated tokens:                  155289    
Total generated tokens (retokenized):    155046    
Request throughput (req/s):              2.79      
Input token throughput (tok/s):          1380.50   
Output token throughput (tok/s):         1443.87   
Peak output token throughput (tok/s):    1920.00   
Peak concurrent requests:                40        
Total token throughput (tok/s):          2824.37   
Concurrency:                             30.39     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   10894.28  
Median E2E Latency (ms):                 10924.98  
P90 E2E Latency (ms):                    18551.79  
P99 E2E Latency (ms):                    22079.93  
---------------Time to First Token----------------
Mean TTFT (ms):                          546.17    
Median TTFT (ms):                        86.46     
P99 TTFT (ms):                           4295.22   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          20.24     
Median TPOT (ms):                        20.06     
P99 TPOT (ms):                           27.76     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           20.03     
Median ITL (ms):                         16.69     
P95 ITL (ms):                            65.70     
P99 ITL (ms):                            70.54     
Max ITL (ms):                            1128.52   
==================================================